doc/td/td_pointeur_fonction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Compilation, pointeur &amp; références</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="td_pointeur_fonction.html">Compilation, pointeur & références </a><a href="td_specificite_c++.html">Spécificités du C++ </a><a href="td_classes.html">Classes en C++ </a><a href="td_classe_complexe.html">Fraction de nombres complexes </a><a href="td_nombre_aleatoire.html">Constructeur & destructeurs </a><a href="td_surcharge_operateur.html">Surcharge d'opérateur </a><a href="td_polymorphisme.html">Polymorphisme & classe abstraite </a><a href="td_blackjack.html">Jeu du blackjack </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Compilation, pointeur &amp; références</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Compilation conditionnelle</h2>
<div class="outline-text-2" id="text-1">
<p>
Compiler le code suivant, sans puis avec les options de &ldquo;warnings&rdquo;
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span> ()
{
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">entierNonSigne</span>;
  <span class="org-type">int</span> <span class="org-variable-name">entierSigne</span> = entierNonSigne;

  cout &lt;&lt; entierNonSigne &lt;&lt; <span class="org-string">" "</span> &lt;&lt; entierSigne &lt;&lt; endl;

  <span class="org-keyword">for</span> (<span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">iEntier</span> = 0; iEntier &lt; entierSigne; ++iEntier)
    cout &lt;&lt; iEntier &lt;&lt; endl;
}
</pre>
</div>

<p>
Avant exécution, corriger les &ldquo;erreurs&rdquo; puis tester le programme. Ajouter
finalement une directive de préprocesseur d&rsquo;identificateur <code>DEBUG</code> permettant
l&rsquo;affichage ou non des différentes valeurs d&rsquo;entier et compiler suivant les deux
cas. S&rsquo;assurer du résultat en précompilant le code source.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Pointeurs &amp; références</h2>
<div class="outline-text-2" id="text-2">
<p>
Créer un programme dans lequel vous déclarerez :
</p>

<ul class="org-ul">
<li>un entier,
</li>
<li>une référence vers cet entier,
</li>
<li>un pointeur vers cet entier.
</li>
</ul>

<p>
Vous afficherez la valeur et l&rsquo;adresse de cette variable ainsi que la valeur
pointée.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Opérateurs <code>new</code> et <code>delete</code></h2>
<div class="outline-text-2" id="text-3">
<p>
Écrire en C++, en utilisant les outils spécifiques à ce langage, les
instructions C suivantes :
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">double</span> * <span class="org-variable-name">pt_tabular</span>;
<span class="org-type">int</span> <span class="org-variable-name">n_value</span>;
printf (<span class="org-string">"Combien de valeurs souhaitez vous allouer en m&#233;moire ?"</span>);
scanf (<span class="org-string">"%d"</span>, &amp;n_value);
pt_tabular = (<span class="org-type">double</span> *) malloc (<span class="org-keyword">sizeof</span> (<span class="org-type">double</span>) * n_value);
free (pt_tabular);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Fonction &amp; références</h2>
<div class="outline-text-2" id="text-4">
<p>
Écrire une fonction permettant d&rsquo;échanger les contenus de 2 variables de type
<code>int</code> fournies en argument:
</p>

<ol class="org-ol">
<li>en transmettant l&rsquo;adresse des variables concernées (seule méthode utilisable
en C),
</li>
<li>en utilisant la transmission par référence
</li>
</ol>

<p>
Dans les deux cas, vous écrirez un programme d&rsquo;essai de la fonction.
</p>
</div>
</div>
</div>
</body>
</html>
